import React from "react";

class Daijeon extends React.Component {
  render() {
    return (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        style={{ background: "#eaeaea" }}
        width="800"
        height="1002"
        overflow="visible"
      >
        <defs>
          <filter id="dropshadow">
            <feGaussianBlur in="SourceAlpha" stdDeviation="7"></feGaussianBlur>
            <feOffset result="offsetblur"></feOffset>
            <feMerge>
              <feMergeNode></feMergeNode>
              <feMergeNode in="SourceGraphic"></feMergeNode>
            </feMerge>
          </filter>
          <filter id="dropshadow2">
            <feGaussianBlur
              in="SourceAlpha"
              stdDeviation="1.4"
            ></feGaussianBlur>
            <feOffset dx="1" dy="1" result="offsetblur"></feOffset>
            <feMerge>
              <feMergeNode></feMergeNode>
              <feMergeNode in="SourceGraphic"></feMergeNode>
            </feMerge>
          </filter>
        </defs>
        <g filter="url(#dropshadow)">
          <path
            id="CD30110"
            d="M591 241l-5 11-1 12 4 11 7 14 7 22 8 15 9 1 9-7 6-23 11-6 24 4 20 1 11 22 6 8 11 13 11 11h2l1-1 1 3-13 7-25-1-20 13-10 8-6 4 2 6-1 5v4l1 9-2 7 2 6 1 9-3 12-3 18-9 21-19 11-10 11-10 10 1 15 3 17v2l-7 12-6 18 3 27-6 12-3-2-3 2-3 6 4 10 8 19-3 23-11 12-2 11-4 27 3 23 2 14 6 12-3 10-11 12-17 9-9 11-14 9 1 12 3 6-14 5-8 9-8 13-8 16-22 7-17-8-10-14-18-10 9-6 2-4-4-6 4-9v-13l-4-11 1-4 6-2 9 4 7-6 6-12 9-18-8-18-9-13-8-18 9-16 9-13-3-11-7-13-8-20-3-13 10 2 4-4 18-9 17 6 16 1-4-11-7-15-13-19-14-9-9-17-7-11-12-18-9-11-12-19 8-16 10-8 13-21 12 2 15 15 18-3 21 5 4-21-9-18-7-10-9-19v-23l2-23 4-18 14-13 10-9 11-15 6-14 14-26 15-22z"
            className="OUTLINE"
          ></path>
          <path
            id="CD30140"
            d="M506 607l7 15 4 11-16-1-17-6-18 9-4 4-10-2 3 13 8 20 7 13 3 11-9 13-9 16 8 18 9 13 8 18-9 18-6 12-7 6-9-4-6 2-1 4 4 11v13l-4 9 4 6-2 4-9 6-23-16-8-20-9-12-9-15-21-8 3-20-5-23 5-22-14-23-20-9-6-19-4-11-2-6 4-9 15-13 10-11 1-8-2-6-2-6 6-7 6-15 2-27 7-15 12-11 12-13 5-10 4-18 16 13 12 4 12 19 9 11 12 18 7 11 9 17 14 9z"
            className="OUTLINE"
          ></path>
          <path
            id="CD30170"
            d="M326 648l-4 7 2 6 4 11 6 19-21 10-8 23 4 19 3 28-3 22v24l-3 18-13 14-12 12-6 11 2 4v7l-8 11-10 18-15 7-1-30-7-16-12-7-8-25-9-17-13-9-11-12-2 12-20-1-2-11-14-13-10-23-2-10-1-2 1-6-2-7 3-6 8-13 15-11 1-2h2l11-11 17-9 8-14 5-15 13-13 7-20 8-13 14-11 7-17 7-10-2-23 4-22 25-3 5-22-4-28 10-12 9-12 15-13 18-16 26-1 15 5 14 22 4 8 2 6 4 20-4 18-5 10-12 13-12 11-7 15-2 27-6 15-6 7 2 6 2 6-1 8-10 11z"
            className="OUTLINE"
          ></path>
          <path
            id="CD30200"
            d="M284 529l-25 3-4 22 2 23-7 10-7 17-14 11-8 13-7 20-13 13-5 15-8 14-17 9-11 11-2-1-12-2-26-10-14-9-12-7-16-14-11-17 3-21 17-6v-20l-1-23 4-26-1-12h2l11-9 2-21 16-13 4-18-9-27 12-19 5-12 1-10-2-10-1-17v-24l2-14 2-13 8-23 15-6 9-13 24-9 25 6 23-5 11-8 11-9 8-25 7-15 15-10 8-14 3-6-3-9v-10l7-10 5-24-7-18 6-18 11 4 4-1 13-12 11-14 6-2 13 6 12 11 13 15 6 9 1 21-4 10-2 20-1 24-12 14-10 13v13l7 9 12 13 15 13 13 8 9 12 6 18-7 21-5 13-4 16v22l-9 23-21 9-8 13-15-5-26 1-18 16-15 13-9 12-10 12 4 28z"
            className="OUTLINE"
          ></path>
          <path
            id="CD30230"
            d="M572 149l-5 20-6 11-2 12 7 12 12 4 11-1 12-5 12 2 1 11-7 9-16 17-9 5-15 22-14 26-6 14-11 15-10 9-14 13-4 18-2 23v23l9 19 7 10 9 18-4 21-21-5-18 3-15-15-12-2-13 21-10 8-8 16-12-4-16-13-4-20-2-6-4-8-14-22 8-13 21-9 9-23v-22l4-16 5-13 7-21-6-18-9-12-13-8-15-13-12-13-7-9v-13l10-13 12-14 18 3 22-1 24-4 14 1-5 1 8 3 9 8 24 4 12-6 7-13 6-25 9-15 9-7z"
            className="OUTLINE"
          ></path>
        </g>
        <g filter="url(#dropshadow2)">
          <text id="LCD30110" x="552" y="551" className="TEXT">
            동구
          </text>
          <text id="LCD30140" x="414" y="666" className="TEXT">
            중구
          </text>
          <text id="LCD30170" x="272" y="667" className="TEXT">
            서구
          </text>
          <text id="LCD30200" x="247" y="410" className="TEXT">
            유성구
          </text>
          <text id="LCD30230" x="477" y="317" className="TEXT">
            대덕구
          </text>
        </g>
      </svg>
    );
  }
}

export default Daijeon;
